```hcl
10:09:18.778 INFO   The runner at . will be processed in the following order for command plan:
Group 1
- Unit ./s3
- Unit ./vpc

Group 2
- Unit ./eks



Initializing the backend...

Initializing provider plugins...

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
module.vpcs["medvista-runner"].aws_vpc.this[0]: Refreshing state... [id=vpc-068832b2aaef968e4]
module.vpcs["medvista-runner"].aws_default_route_table.default[0]: Refreshing state... [id=rtb-09479e728471dc776]
module.vpcs["medvista-runner"].aws_default_security_group.this[0]: Refreshing state... [id=sg-072c58a5038a7c309]
module.vpcs["medvista-runner"].aws_subnet.public[1]: Refreshing state... [id=subnet-0eb1cbc30c299b269]
module.vpcs["medvista-runner"].aws_default_network_acl.this[0]: Refreshing state... [id=acl-007a1d04b8e8965bc]
module.vpcs["medvista-runner"].aws_subnet.public[0]: Refreshing state... [id=subnet-0c6275b6bebc113ac]
module.vpcs["medvista-runner"].aws_internet_gateway.this[0]: Refreshing state... [id=igw-06f6debb07a269ec1]
module.vpcs["medvista-runner"].aws_subnet.private[0]: Refreshing state... [id=subnet-0a421cb1ae52b1316]
module.vpcs["medvista-runner"].aws_subnet.private[1]: Refreshing state... [id=subnet-0c62b4a8241fa4f0c]
module.vpcs["medvista-runner"].aws_route_table.public[0]: Refreshing state... [id=rtb-074e383b1e8052219]
module.vpcs["medvista-runner"].aws_route_table.private[0]: Refreshing state... [id=rtb-0fe4fd03f4991d058]
module.vpcs["medvista-runner"].aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-074e383b1e80522191080289494]
module.vpcs["medvista-runner"].aws_eip.nat[0]: Refreshing state... [id=eipalloc-02a56d4a1991b7687]
module.vpcs["medvista-runner"].aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-06e8812dcbf26a61c]
module.vpcs["medvista-runner"].aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0d9da1df4d55b5a59]
module.vpcs["medvista-runner"].aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-06a8035a17c669b3e]
module.vpcs["medvista-runner"].aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01ca636eb503e7f19]
module.vpcs["medvista-runner"].aws_nat_gateway.this[0]: Refreshing state... [id=nat-056c71dfbc74199b8]
module.vpcs["medvista-runner"].aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0fe4fd03f4991d0581080289494]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
module.medvista_runner.module.eks.module.eks_managed_node_group["runner"].data.aws_caller_identity.current: Reading...
module.medvista_runner.module.eks.data.aws_partition.current[0]: Reading...
module.medvista_runner.module.eks.data.aws_caller_identity.current[0]: Reading...
module.medvista_runner.module.eks.module.eks_managed_node_group["general"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.medvista_runner.module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.medvista_runner.module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.medvista_runner.module.eks.module.eks_managed_node_group["general"].data.aws_caller_identity.current: Reading...
module.medvista_runner.module.eks.module.eks_managed_node_group["runner"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.medvista_runner.module.eks.module.eks_managed_node_group["runner"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.medvista_runner.module.eks.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.medvista_runner.module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.medvista_runner.module.eks.module.eks_managed_node_group["general"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.medvista_runner.module.eks.module.eks_managed_node_group["general"].data.aws_partition.current: Reading...
module.medvista_runner.module.eks.module.eks_managed_node_group["runner"].data.aws_partition.current: Reading...
module.medvista_runner.module.eks.module.eks_managed_node_group["general"].data.aws_partition.current: Read complete after 0s [id=aws]
module.medvista_runner.module.eks.module.eks_managed_node_group["runner"].data.aws_partition.current: Read complete after 0s [id=aws]
module.medvista_runner.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.medvista_runner.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
module.medvista_runner.module.eks.data.aws_iam_policy_document.custom[0]: Reading...
module.medvista_runner.module.eks.data.aws_iam_policy_document.custom[0]: Read complete after 0s [id=513122117]
module.medvista_runner.module.eks.module.eks_managed_node_group["runner"].data.aws_caller_identity.current: Read complete after 0s [id=587210147621]
module.medvista_runner.module.eks.data.aws_caller_identity.current[0]: Read complete after 0s [id=587210147621]
module.medvista_runner.module.eks.data.aws_iam_session_context.current[0]: Reading...
module.medvista_runner.module.eks.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:iam::587210147621:user/terraform]
module.medvista_runner.module.eks.module.eks_managed_node_group["general"].data.aws_caller_identity.current: Read complete after 0s [id=587210147621]
module.medvista_runner.module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 1s [id=587210147621]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.medvista_runner.data.kubernetes_secret.k8s_secret_data will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_secret" "k8s_secret_data" {
      + data      = (sensitive value)
      + id        = (known after apply)
      + immutable = (known after apply)
      + type      = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "devops-admin"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.medvista_runner.kubernetes_cluster_role_binding.k8s_role_binding will be created
  + resource "kubernetes_cluster_role_binding" "k8s_role_binding" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "devops-admin"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "cluster-admin"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = "devops-admin"
          + namespace = "kube-system"
        }
    }

  # module.medvista_runner.kubernetes_secret.k8s_secret will be created
  + resource "kubernetes_secret" "k8s_secret" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "kubernetes.io/service-account-token"
      + wait_for_service_account_token = true

      + metadata {
          + annotations      = {
              + "kubernetes.io/service-account.name"      = "devops-admin"
              + "kubernetes.io/service-account.namespace" = "kube-system"
            }
          + generation       = (known after apply)
          + name             = "devops-admin"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.medvista_runner.kubernetes_service_account.k8s_service_account will be created
  + resource "kubernetes_service_account" "k8s_service_account" {
      + automount_service_account_token = false
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "devops-admin"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.medvista_runner.local_file.kubeconfig will be created
  + resource "local_file" "kubeconfig" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "/home/runner/work/Infrastructure/Infrastructure/terraform/medvista-aws-ap-south-1/eks/kubeconfigs/devops-admin-medvista-runner-kubeconfig.yaml"
      + id                   = (known after apply)
    }

  # module.medvista_runner.module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.medvista_runner.module.eks.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/eks/medvista-runner/cluster"
      + name_prefix       = (known after apply)
      + retention_in_days = 5
      + skip_destroy      = false
      + tags              = {
          + "Contacts"    = "pranat.pattankude@corazoncare.com"
          + "Created_By"  = "Terraform"
          + "Environment" = "Runners"
          + "Name"        = "/aws/eks/medvista-runner/cluster"
          + "Owner"       = "terraform"
          + "Project"     = "Medvista"
        }
      + tags_all          = {
          + "Contacts"    = "pranat.pattankude@corazoncare.com"
          + "Created_By"  = "Terraform"
          + "Environment" = "Runners"
          + "Name"        = "/aws/eks/medvista-runner/cluster"
          + "Owner"       = "terraform"
          + "Project"     = "Medvista"
        }
    }

  # module.medvista_runner.module.eks.aws_ec2_tag.cluster_primary_security_group["Contacts"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Contacts"
      + resource_id = (known after apply)
      + value       = "pranat.pattankude@corazoncare.com"
    }

  # module.medvista_runner.module.eks.aws_ec2_tag.cluster_primary_security_group["Created_By"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Created_By"
      + resource_id = (known after apply)
      + value       = "Terraform"
    }

  # module.medvista_runner.module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Environment"
      + resource_id = (known after apply)
      + value       = "Runners"
    }

  # module.medvista_runner.module.eks.aws_ec2_tag.cluster_primary_security_group["Owner"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Owner"
      + resource_id = (known after apply)
      + value       = "terraform"
    }

  # module.medvista_runner.module.eks.aws_ec2_tag.cluster_primary_security_group["Project"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Project"
      + resource_id = (known after apply)
      + value       = "Medvista"
    }

  # module.medvista_runner.module.eks.aws_eks_access_entry.this["cluster_creator"] will be created
  + resource "aws_eks_access_entry" "this" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = (known after apply)
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::587210147621:user/terraform"
      + tags              = {
          + "Contacts"    = "pranat.pattankude@corazoncare.com"
          + "Created_By"  = "Terraform"
          + "Environment" = "Runners"
          + "Owner"       = "terraform"
          + "Project"     = "Medvista"
        }
      + tags_all          = {
          + "Contacts"    = "pranat.pattankude@corazoncare.com"
          + "Created_By"  = "Terraform"
          + "Environment" = "Runners"
          + "Owner"       = "terraform"
          + "Project"     = "Medvista"
        }
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.medvista_runner.module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"] will be created
  + resource "aws_eks_access_policy_association" "this" {
      + associated_at = (known after apply)
      + cluster_name  = (known after apply)
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::587210147621:user/terraform"

      + access_scope {
          + type = "cluster"
        }
    }

  # module.medvista_runner.module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + enabled_cluster_log_types     = [
          + "api",
          + "audit",
          + "authenticator",
        ]
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "medvista-runner"
      + platform_version              = (known after apply)
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags                          = {
          + "Contacts"              = "pranat.pattankude@corazoncare.com"
          + "Created_By"            = "Terraform"
          + "Environment"           = "Runners"
          + "Owner"                 = "terraform"
          + "Project"               = "Medvista"
          + "terraform-aws-modules" = "eks"
        }
      + tags_all                      = {
          + "Contacts"              = "pranat.pattankude@corazoncare.com"
          + "Created_By"            = "Terraform"
          + "Environment"           = "Runners"
          + "Owner"                 = "terraform"
          + "Project"               = "Medvista"
          + "terraform-aws-modules" = "eks"
        }
      + version                       = "1.34"

      + access_config {
          + authentication_mode                         = "API_AND_CONFIG_MAP"
          + bootstrap_cluster_creator_admin_permissions = false
        }

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = (known after apply)
            }
        }

      + kubernetes_network_config {
          + ip_family         = "ipv4"
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)
        }

      + timeouts {}

      + upgrade_policy {
          + support_type = "STANDARD"
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-0a421cb1ae52b1316",
              + "subnet-0c62b4a8241fa4f0c",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.medvista_runner.module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
  + resource "aws_iam_openid_connect_provider" "oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Contacts"    = "pranat.pattankude@corazoncare.com"
          + "Created_By"  = "Terraform"
          + "Environment" = "Runners"
          + "Name"        = "medvista-runner-eks-irsa"
          + "Owner"       = "terraform"
          + "Project"     = "Medvista"
        }
      + tags_all        = {
          + "Contacts"    = "pranat.pattankude@corazoncare.com"
          + "Created_By"  = "Terraform"
          + "Environment" = "Runners"
          + "Name"        = "medvista-runner-eks-irsa"
          + "Owner"       = "terraform"
          + "Project"     = "Medvista"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.medvista_runner.module.eks.aws_iam_policy.cluster_encryption[0] will be created
  + resource "aws_iam_policy" "cluster_encryption" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Cluster encryption policy to allow cluster role to utilize CMK provided"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "medvista-runner-cluster-ClusterEncryption"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "Contacts"    = "pranat.pattankude@corazoncare.com"
          + "Created_By"  = "Terraform"
          + "Environment" = "Runners"
          + "Owner"       = "terraform"
          + "Project"     = "Medvista"
        }
      + tags_all         = {
          + "Contacts"    = "pranat.pattankude@corazoncare.com"
          + "Created_By"  = "Terraform"
          + "Environment" = "Runners"
          + "Owner"       = "terraform"
          + "Project"     = "Medvista"
        }
    }

  # module.medvista_runner.module.eks.aws_iam_policy.custom[0] will be created
  + resource "aws_iam_policy" "custom" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "medvista-runner-cluster-"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ec2:RunInstances",
                          + "ec2:CreateLaunchTemplate",
                          + "ec2:CreateFleet",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/eks:eks-cluster-name" = "${aws:PrincipalTag/eks:eks-cluster-name}"
                            }
                          + StringLike   = {
                              + "aws:RequestTag/eks:kubernetes-node-class-name" = "*"
                              + "aws:RequestTag/eks:kubernetes-node-pool-name"  = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "Compute"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateVolume",
                          + "ec2:CreateSnapshot",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/eks:eks-cluster-name" = "${aws:PrincipalTag/eks:eks-cluster-name}"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:ec2:*:*:volume/*",
                          + "arn:aws:ec2:*:*:snapshot/*",
                        ]
                      + Sid       = "Storage"
                    },
                  + {
                      + Action    = "ec2:CreateNetworkInterface"
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/eks:eks-cluster-name"         = "${aws:PrincipalTag/eks:eks-cluster-name}"
                              + "aws:RequestTag/eks:kubernetes-cni-node-name" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "Networking"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:CreateTargetGroup",
                          + "elasticloadbalancing:CreateRule",
                          + "elasticloadbalancing:CreateLoadBalancer",
                          + "elasticloadbalancing:CreateListener",
                          + "ec2:CreateSecurityGroup",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/eks:eks-cluster-name" = "${aws:PrincipalTag/eks:eks-cluster-name}"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "LoadBalancer"
                    },
                  + {
                      + Action    = "shield:CreateProtection"
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/eks:eks-cluster-name" = "${aws:PrincipalTag/eks:eks-cluster-name}"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "ShieldProtection"
                    },
                  + {
                      + Action    = "shield:TagResource"
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/eks:eks-cluster-name" = "${aws:PrincipalTag/eks:eks-cluster-name}"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:shield::*:protection/*"
                      + Sid       = "ShieldTagResource"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Contacts"    = "pranat.pattankude@corazoncare.com"
          + "Created_By"  = "Terraform"
          + "Environment" = "Runners"
          + "Owner"       = "terraform"
          + "Project"     = "Medvista"
        }
      + tags_all         = {
          + "Contacts"    = "pranat.pattankude@corazoncare.com"
          + "Created_By"  = "Terraform"
          + "Environment" = "Runners"
          + "Owner"       = "terraform"
          + "Project"     = "Medvista"
        }
    }

  # module.medvista_runner.module.eks.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:TagSession",
                          + "sts:AssumeRole",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "medvista-runner-cluster-"
      + path                  = "/"
      + tags                  = {
          + "Contacts"    = "pranat.pattankude@corazoncare.com"
          + "Created_By"  = "Terraform"
          + "Environment" = "Runners"
          + "Owner"       = "terraform"
          + "Project"     = "Medvista"
        }
      + tags_all              = {
          + "Contacts"    = "pranat.pattankude@corazoncare.com"
          + "Created_By"  = "Terraform"
          + "Environment" = "Runners"
          + "Owner"       = "terraform"
          + "Project"     = "Medvista"
        }
      + unique_id             = (known after apply)
    }

  # module.medvista_runner.module.eks.aws_iam_role_policy_attachment.cluster_encryption[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_encryption" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.medvista_runner.module.eks.aws_iam_role_policy_attachment.custom[0] will be created
  + resource "aws_iam_role_policy_attachment" "custom" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.medvista_runner.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # module.medvista_runner.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = (known after apply)
    }

  # module.medvista_runner.module.eks.aws_security_group.cluster[0] will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "EKS cluster security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "medvista-runner-cluster-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Contacts"    = "pranat.pattankude@corazoncare.com"
          + "Created_By"  = "Terraform"
          + "Environment" = "Runners"
          + "Name"        = "medvista-runner-cluster"
          + "Owner"       = "terraform"
          + "Project"     = "Medvista"
        }
      + tags_all               = {
          + "Contacts"    = "pranat.pattankude@corazoncare.com"
          + "Created_By"  = "Terraform"
          + "Environment" = "Runners"
          + "Name"        = "medvista-runner-cluster"
          + "Owner"       = "terraform"
          + "Project"     = "Medvista"
        }
      + vpc_id                 = "vpc-068832b2aaef968e4"
    }

  # module.medvista_runner.module.eks.aws_security_group.node[0] will be created
  + resource "aws_security_group" "node" {
      + arn                    = (known after apply)
      + description            = "EKS node shared security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "medvista-runner-node-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Contacts"                              = "pranat.pattankude@corazoncare.com"
          + "Created_By"                            = "Terraform"
          + "Environment"                           = "Runners"
          + "Name"                                  = "medvista-runner-node"
          + "Owner"                                 = "terraform"
          + "Project"                               = "Medvista"
          + "kubernetes.io/cluster/medvista-runner" = "owned"
        }
      + tags_all               = {
          + "Contacts"                              = "pranat.pattankude@corazoncare.com"
          + "Created_By"                            = "Terraform"
          + "Environment"                           = "Runners"
          + "Name"                                  = "medvista-runner-node"
          + "Owner"                                 = "terraform"
          + "Project"                               = "Medvista"
          + "kubernetes.io/cluster/medvista-runner" = "owned"
        }
      + vpc_id                 = "vpc-068832b2aaef968e4"
    }

  # module.medvista_runner.module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Node groups to cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.medvista_runner.module.eks.aws_security_group_rule.node["egress_all"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all egress"
      + from_port                = 0
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.medvista_runner.module.eks.aws_security_group_rule.node["ingress_cluster_443"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node groups"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.medvista_runner.module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 4443/tcp webhook"
      + from_port                = 4443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 4443
      + type                     = "ingress"
    }

  # module.medvista_runner.module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 6443/tcp webhook"
      + from_port                = 6443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 6443
      + type                     = "ingress"
    }

  # module.medvista_runner.module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 8443/tcp webhook"
      + from_port                = 8443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8443
      + type                     = "ingress"
    }

  # module.medvista_runner.module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 9443/tcp webhook"
      + from_port                = 9443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 9443
      + type                     = "ingress"
    }

  # module.medvista_runner.module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node kubelets"
      + from_port                = 10250
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # module.medvista_runner.module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node ingress on ephemeral ports"
      + from_port                = 1025
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.medvista_runner.module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.medvista_runner.module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS UDP"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.medvista_runner.module.eks.time_sleep.this[0] will be created
  + resource "time_sleep" "this" {
      + create_duration = "30s"
      + id              = (known after apply)
      + triggers        = {
          + "cluster_certificate_authority_data" = (known after apply)
          + "cluster_endpoint"                   = (known after apply)
          + "cluster_name"                       = (known after apply)
          + "cluster_service_cidr"               = (known after apply)
          + "cluster_version"                    = "1.34"
        }
    }

  # module.medvista_runner.module.eks.module.eks_managed_node_group["general"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = (known after apply)
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "m7i.xlarge",
        ]
      + labels                 = {
          + "role" = "general"
        }
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "general-"
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-0a421cb1ae52b1316",
          + "subnet-0c62b4a8241fa4f0c",
        ]
      + tags                   = {
          + "Contacts"    = "pranat.pattankude@corazoncare.com"
          + "Created_By"  = "Terraform"
          + "Environment" = "Runners"
          + "Name"        = "general"
          + "Owner"       = "terraform"
          + "Project"     = "Medvista"
        }
      + tags_all               = {
          + "Contacts"    = "pranat.pattankude@corazoncare.com"
          + "Created_By"  = "Terraform"
          + "Environment" = "Runners"
          + "Name"        = "general"
          + "Owner"       = "terraform"
          + "Project"     = "Medvista"
        }
      + version                = "1.34"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 1
          + max_size     = 1
          + min_size     = 1
        }

      + timeouts {}

      + update_config {
          + max_unavailable_percentage = 33
        }
    }

  # module.medvista_runner.module.eks.module.eks_managed_node_group["general"].aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSNodeAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "EKS managed node group IAM role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "general-eks-node-group-"
      + path                  = "/"
      + tags                  = {
          + "Contacts"    = "pranat.pattankude@corazoncare.com"
          + "Created_By"  = "Terraform"
          + "Environment" = "Runners"
          + "Owner"       = "terraform"
          + "Project"     = "Medvista"
        }
      + tags_all              = {
          + "Contacts"    = "pranat.pattankude@corazoncare.com"
          + "Created_By"  = "Terraform"
          + "Environment" = "Runners"
          + "Owner"       = "terraform"
          + "Project"     = "Medvista"
        }
      + unique_id             = (known after apply)
    }

  # module.medvista_runner.module.eks.module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.additional["policy_arn"] will be created
  + resource "aws_iam_role_policy_attachment" "additional" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # module.medvista_runner.module.eks.module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.medvista_runner.module.eks.module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.medvista_runner.module.eks.module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.medvista_runner.module.eks.module.eks_managed_node_group["general"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Custom launch template for general EKS managed node group"
      + id                     = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "general-"
      + tags                   = {
          + "Contacts"    = "pranat.pattankude@corazoncare.com"
          + "Created_By"  = "Terraform"
          + "Environment" = "Runners"
          + "Owner"       = "terraform"
          + "Project"     = "Medvista"
        }
      + tags_all               = {
          + "Contacts"    = "pranat.pattankude@corazoncare.com"
          + "Created_By"  = "Terraform"
          + "Environment" = "Runners"
          + "Owner"       = "terraform"
          + "Project"     = "Medvista"
        }
      + update_default_version = true
      + vpc_security_group_ids = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + monitoring {
          + enabled = true
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Contacts"    = "pranat.pattankude@corazoncare.com"
              + "Created_By"  = "Terraform"
              + "Environment" = "Runners"
              + "Name"        = "general"
              + "Owner"       = "terraform"
              + "Project"     = "Medvista"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Contacts"    = "pranat.pattankude@corazoncare.com"
              + "Created_By"  = "Terraform"
              + "Environment" = "Runners"
              + "Name"        = "general"
              + "Owner"       = "terraform"
              + "Project"     = "Medvista"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Contacts"    = "pranat.pattankude@corazoncare.com"
              + "Created_By"  = "Terraform"
              + "Environment" = "Runners"
              + "Name"        = "general"
              + "Owner"       = "terraform"
              + "Project"     = "Medvista"
            }
        }
    }

  # module.medvista_runner.module.eks.module.eks_managed_node_group["runner"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = (known after apply)
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "m7i.xlarge",
        ]
      + labels                 = {
          + "role" = "runner"
        }
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "runner-"
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-0a421cb1ae52b1316",
          + "subnet-0c62b4a8241fa4f0c",
        ]
      + tags                   = {
          + "Contacts"    = "pranat.pattankude@corazoncare.com"
          + "Created_By"  = "Terraform"
          + "Environment" = "Runners"
          + "Name"        = "runner"
          + "Owner"       = "terraform"
          + "Project"     = "Medvista"
        }
      + tags_all               = {
          + "Contacts"    = "pranat.pattankude@corazoncare.com"
          + "Created_By"  = "Terraform"
          + "Environment" = "Runners"
          + "Name"        = "runner"
          + "Owner"       = "terraform"
          + "Project"     = "Medvista"
        }
      + version                = "1.34"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 0
          + max_size     = 1
          + min_size     = 0
        }

      + taint {
          + effect = "NO_SCHEDULE"
          + key    = "dedicated"
          + value  = "runner"
        }

      + timeouts {}

      + update_config {
          + max_unavailable_percentage = 33
        }
    }

  # module.medvista_runner.module.eks.module.eks_managed_node_group["runner"].aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSNodeAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "EKS managed node group IAM role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "runner-eks-node-group-"
      + path                  = "/"
      + tags                  = {
          + "Contacts"    = "pranat.pattankude@corazoncare.com"
          + "Created_By"  = "Terraform"
          + "Environment" = "Runners"
          + "Owner"       = "terraform"
          + "Project"     = "Medvista"
        }
      + tags_all              = {
          + "Contacts"    = "pranat.pattankude@corazoncare.com"
          + "Created_By"  = "Terraform"
          + "Environment" = "Runners"
          + "Owner"       = "terraform"
          + "Project"     = "Medvista"
        }
      + unique_id             = (known after apply)
    }

  # module.medvista_runner.module.eks.module.eks_managed_node_group["runner"].aws_iam_role_policy_attachment.additional["policy_arn"] will be created
  + resource "aws_iam_role_policy_attachment" "additional" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # module.medvista_runner.module.eks.module.eks_managed_node_group["runner"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.medvista_runner.module.eks.module.eks_managed_node_group["runner"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.medvista_runner.module.eks.module.eks_managed_node_group["runner"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.medvista_runner.module.eks.module.eks_managed_node_group["runner"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Custom launch template for runner EKS managed node group"
      + id                     = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "runner-"
      + tags                   = {
          + "Contacts"    = "pranat.pattankude@corazoncare.com"
          + "Created_By"  = "Terraform"
          + "Environment" = "Runners"
          + "Owner"       = "terraform"
          + "Project"     = "Medvista"
        }
      + tags_all               = {
          + "Contacts"    = "pranat.pattankude@corazoncare.com"
          + "Created_By"  = "Terraform"
          + "Environment" = "Runners"
          + "Owner"       = "terraform"
          + "Project"     = "Medvista"
        }
      + update_default_version = true
      + vpc_security_group_ids = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + monitoring {
          + enabled = true
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Contacts"    = "pranat.pattankude@corazoncare.com"
              + "Created_By"  = "Terraform"
              + "Environment" = "Runners"
              + "Name"        = "runner"
              + "Owner"       = "terraform"
              + "Project"     = "Medvista"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Contacts"    = "pranat.pattankude@corazoncare.com"
              + "Created_By"  = "Terraform"
              + "Environment" = "Runners"
              + "Name"        = "runner"
              + "Owner"       = "terraform"
              + "Project"     = "Medvista"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Contacts"    = "pranat.pattankude@corazoncare.com"
              + "Created_By"  = "Terraform"
              + "Environment" = "Runners"
              + "Name"        = "runner"
              + "Owner"       = "terraform"
              + "Project"     = "Medvista"
            }
        }
    }

  # module.medvista_runner.module.eks.module.kms.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
      + id                        = (known after apply)
      + json                      = (known after apply)
      + minified_json             = (known after apply)
      + override_policy_documents = []
      + source_policy_documents   = []

      + statement {
          + actions   = [
              + "kms:*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "Default"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::587210147621:root",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:CancelKeyDeletion",
              + "kms:Create*",
              + "kms:Delete*",
              + "kms:Describe*",
              + "kms:Disable*",
              + "kms:Enable*",
              + "kms:Get*",
              + "kms:ImportKeyMaterial",
              + "kms:List*",
              + "kms:Put*",
              + "kms:ReplicateKey",
              + "kms:Revoke*",
              + "kms:ScheduleKeyDeletion",
              + "kms:TagResource",
              + "kms:UntagResource",
              + "kms:Update*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "KeyAdministration"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::587210147621:user/terraform",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:Encrypt",
              + "kms:GenerateDataKey*",
              + "kms:ReEncrypt*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "KeyUsage"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.medvista_runner.module.eks.module.kms.aws_kms_alias.this["cluster"] will be created
  + resource "aws_kms_alias" "this" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/eks/medvista-runner"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.medvista_runner.module.eks.module.kms.aws_kms_key.this[0] will be created
  + resource "aws_kms_key" "this" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "medvista-runner cluster encryption key"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = false
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Contacts"              = "pranat.pattankude@corazoncare.com"
          + "Created_By"            = "Terraform"
          + "Environment"           = "Runners"
          + "Owner"                 = "terraform"
          + "Project"               = "Medvista"
          + "terraform-aws-modules" = "eks"
        }
      + tags_all                           = {
          + "Contacts"              = "pranat.pattankude@corazoncare.com"
          + "Created_By"            = "Terraform"
          + "Environment"           = "Runners"
          + "Owner"                 = "terraform"
          + "Project"               = "Medvista"
          + "terraform-aws-modules" = "eks"
        }
    }

  # module.medvista_runner.module.eks.module.eks_managed_node_group["general"].module.user_data.null_resource.validate_cluster_service_cidr will be created
  + resource "null_resource" "validate_cluster_service_cidr" {
      + id = (known after apply)
    }

  # module.medvista_runner.module.eks.module.eks_managed_node_group["runner"].module.user_data.null_resource.validate_cluster_service_cidr will be created
  + resource "null_resource" "validate_cluster_service_cidr" {
      + id = (known after apply)
    }

Plan: 53 to add, 0 to change, 0 to destroy.

Warning: Deprecated Resource

  with module.medvista_runner.kubernetes_service_account.k8s_service_account,
  on ../modules/runner-eks-with-kubeconfig/main.tf line 35, in resource "kubernetes_service_account" "k8s_service_account":
  35: resource "kubernetes_service_account" "k8s_service_account" {

Deprecated; use kubernetes_service_account_v1.

(and 6 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf-plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf-plan"
```

<!-- thollander/actions-comment-pull-request "file" -->